#loc25 = loc("<stdin>":27:26)
#loc26 = loc("<stdin>":27:116)
#loc27 = loc("<stdin>":27:204)
#loc28 = loc("<stdin>":27:294)
#loc2458 = loc("<stdin>":2457:26)
#loc2459 = loc("<stdin>":2457:117)
#loc2460 = loc("<stdin>":2457:206)
#loc2461 = loc("<stdin>":2457:295)
#loc2462 = loc("<stdin>":2457:386)
#loc4676 = loc("<stdin>":4672:10)
#loc4677 = loc("<stdin>":4672:20)
#loc4678 = loc("<stdin>":4672:32)
#map = affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d4)>
#map1 = affine_map<(d0, d1, d2, d3, d4) -> (d0, d1, d2, d3, d4)>
module @module {
  util.global private @__auto.constant_256_256_torch.float16 = dense_resource<__auto.constant_256_256_torch.float16> : tensor<256x256xf16> loc(#loc1)
  util.global private @__auto.constant_256_256_torch.float16$1 = dense_resource<__auto.constant_256_256_torch.float16$1> : tensor<256x256xf16> loc(#loc2)
  util.global private @__auto.constant_128_256_torch.float16 = dense_resource<__auto.constant_128_256_torch.float16> : tensor<128x256xf16> loc(#loc3)
  util.global private @__auto.constant_128_256_torch.float16$1 = dense_resource<__auto.constant_128_256_torch.float16$1> : tensor<128x256xf16> loc(#loc4)
  util.global private @__auto.constant_256_256_torch.float16$2 = dense_resource<__auto.constant_256_256_torch.float16$2> : tensor<256x256xf16> loc(#loc5)
  util.global private @__auto.constant_23_256_torch.float16 = dense_resource<__auto.constant_23_256_torch.float16> : tensor<23x256xf16> loc(#loc6)
  util.global private @__auto.constant_23_256_torch.float16$1 = dense_resource<__auto.constant_23_256_torch.float16$1> : tensor<23x256xf16> loc(#loc7)
  util.global private @__auto.constant_256_23_torch.float16 = dense_resource<__auto.constant_256_23_torch.float16> : tensor<256x23xf16> loc(#loc8)
  util.global private @__auto.constant_256_256_torch.float16$3 = dense_resource<__auto.constant_256_256_torch.float16$3> : tensor<256x256xf16> loc(#loc9)
  util.global private @__auto.constant_128_256_torch.float16$2 = dense_resource<__auto.constant_128_256_torch.float16$2> : tensor<128x256xf16> loc(#loc10)
  util.global private @__auto.constant_128_256_torch.float16$3 = dense_resource<__auto.constant_128_256_torch.float16$3> : tensor<128x256xf16> loc(#loc11)
  util.global private @__auto.constant_256_256_torch.float16$4 = dense_resource<__auto.constant_256_256_torch.float16$4> : tensor<256x256xf16> loc(#loc12)
  util.global private @__auto.constant_23_256_torch.float16$2 = dense_resource<__auto.constant_23_256_torch.float16$2> : tensor<23x256xf16> loc(#loc13)
  util.global private @__auto.constant_23_256_torch.float16$3 = dense_resource<__auto.constant_23_256_torch.float16$3> : tensor<23x256xf16> loc(#loc14)
  util.global private @__auto.constant_256_23_torch.float16$1 = dense_resource<__auto.constant_256_23_torch.float16$1> : tensor<256x23xf16> loc(#loc15)
  util.global private @__auto.constant_256_256_torch.float16$5 = dense_resource<__auto.constant_256_256_torch.float16$5> : tensor<256x256xf16> loc(#loc16)
  util.global private @__auto.constant_128_256_torch.float16$4 = dense_resource<__auto.constant_128_256_torch.float16$4> : tensor<128x256xf16> loc(#loc17)
  util.global private @__auto.constant_128_256_torch.float16$5 = dense_resource<__auto.constant_128_256_torch.float16$5> : tensor<128x256xf16> loc(#loc18)
  util.global private @__auto.constant_256_256_torch.float16$6 = dense_resource<__auto.constant_256_256_torch.float16$6> : tensor<256x256xf16> loc(#loc19)
  util.global private @__auto.constant_23_256_torch.float16$4 = dense_resource<__auto.constant_23_256_torch.float16$4> : tensor<23x256xf16> loc(#loc20)
  util.global private @__auto.constant_23_256_torch.float16$5 = dense_resource<__auto.constant_23_256_torch.float16$5> : tensor<23x256xf16> loc(#loc21)
  util.global private @__auto.constant_256_23_torch.float16$2 = dense_resource<__auto.constant_256_23_torch.float16$2> : tensor<256x23xf16> loc(#loc22)
  util.global private @__auto.constant_256_256_torch.float16$7 = dense_resource<__auto.constant_256_256_torch.float16$7> : tensor<256x256xf16> loc(#loc23)
  func.func @prefill_bs4(%arg0: !torch.vtensor<[4,?],si64> {iree.abi.affinity = #hal.device.promise<@__device_0>} loc("<stdin>":27:26), %arg1: !torch.vtensor<[4],si64> {iree.abi.affinity = #hal.device.promise<@__device_0>} loc("<stdin>":27:116), %arg2: !torch.vtensor<[4,?],si64> {iree.abi.affinity = #hal.device.promise<@__device_0>} loc("<stdin>":27:204), %arg3: !torch.tensor<[?,12288],f16> {iree.abi.affinity = #hal.device.promise<@__device_0>} loc("<stdin>":27:294)) -> !torch.vtensor<[4,?,256],f16> attributes {torch.assume_strict_symbolic_shapes} {
    %__auto.constant_256_256_torch.float16 = util.global.load @__auto.constant_256_256_torch.float16 : tensor<256x256xf16> loc(#loc29)
    %0 = torch_c.from_builtin_tensor %__auto.constant_256_256_torch.float16 : tensor<256x256xf16> -> !torch.vtensor<[256,256],f16> loc(#loc30)
    %1 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32> : tensor<256xf32>) : !torch.vtensor<[256],f32> loc(#loc31)
    %__auto.constant_256_256_torch.float16$1 = util.global.load @__auto.constant_256_256_torch.float16$1 : tensor<256x256xf16> loc(#loc32)
    %2 = torch_c.from_builtin_tensor %__auto.constant_256_256_torch.float16$1 : tensor<256x256xf16> -> !torch.vtensor<[256,256],f16> loc(#loc33)
    %__auto.constant_128_256_torch.float16 = util.global.load @__auto.constant_128_256_torch.float16 : tensor<128x256xf16> loc(#loc34)
    %3 = torch_c.from_builtin_tensor %__auto.constant_128_256_torch.float16 : tensor<128x256xf16> -> !torch.vtensor<[128,256],f16> loc(#loc35)
    %__auto.constant_128_256_torch.float16$1 = util.global.load @__auto.constant_128_256_torch.float16$1 : tensor<128x256xf16> loc(#loc36)
    %4 = torch_c.from_builtin_tensor %__auto.constant_128_256_torch.float16$1 : tensor<128x256xf16> -> !torch.vtensor<[128,256],f16> loc(#loc37)
    %5 = torch.vtensor.literal(dense<1.000000e+00> : tensor<f32>) : !torch.vtensor<[],f32> loc(#loc38)
    %6 = torch.vtensor.literal(dense<1.000000e+00> : tensor<f32>) : !torch.vtensor<[],f32> loc(#loc39)
    %7 = torch.vtensor.literal(dense<0xFC00> : tensor<f16>) : !torch.vtensor<[],f16> loc(#loc40)
    %__auto.constant_256_256_torch.float16$2 = util.global.load @__auto.constant_256_256_torch.float16$2 : tensor<256x256xf16> loc(#loc41)
    %8 = torch_c.from_builtin_tensor %__auto.constant_256_256_torch.float16$2 : tensor<256x256xf16> -> !torch.vtensor<[256,256],f16> loc(#loc42)
    %9 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32_1> : tensor<256xf32>) : !torch.vtensor<[256],f32> loc(#loc43)
    %__auto.constant_23_256_torch.float16 = util.global.load @__auto.constant_23_256_torch.float16 : tensor<23x256xf16> loc(#loc44)
    %10 = torch_c.from_builtin_tensor %__auto.constant_23_256_torch.float16 : tensor<23x256xf16> -> !torch.vtensor<[23,256],f16> loc(#loc45)
    %__auto.constant_23_256_torch.float16$1 = util.global.load @__auto.constant_23_256_torch.float16$1 : tensor<23x256xf16> loc(#loc46)
    %11 = torch_c.from_builtin_tensor %__auto.constant_23_256_torch.float16$1 : tensor<23x256xf16> -> !torch.vtensor<[23,256],f16> loc(#loc47)
    %__auto.constant_256_23_torch.float16 = util.global.load @__auto.constant_256_23_torch.float16 : tensor<256x23xf16> loc(#loc48)
    %12 = torch_c.from_builtin_tensor %__auto.constant_256_23_torch.float16 : tensor<256x23xf16> -> !torch.vtensor<[256,23],f16> loc(#loc49)
    %13 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32_2> : tensor<256xf32>) : !torch.vtensor<[256],f32> loc(#loc50)
    %__auto.constant_256_256_torch.float16$3 = util.global.load @__auto.constant_256_256_torch.float16$3 : tensor<256x256xf16> loc(#loc51)
    %14 = torch_c.from_builtin_tensor %__auto.constant_256_256_torch.float16$3 : tensor<256x256xf16> -> !torch.vtensor<[256,256],f16> loc(#loc52)
    %__auto.constant_128_256_torch.float16$2 = util.global.load @__auto.constant_128_256_torch.float16$2 : tensor<128x256xf16> loc(#loc53)
    %15 = torch_c.from_builtin_tensor %__auto.constant_128_256_torch.float16$2 : tensor<128x256xf16> -> !torch.vtensor<[128,256],f16> loc(#loc54)
    %__auto.constant_128_256_torch.float16$3 = util.global.load @__auto.constant_128_256_torch.float16$3 : tensor<128x256xf16> loc(#loc55)
    %16 = torch_c.from_builtin_tensor %__auto.constant_128_256_torch.float16$3 : tensor<128x256xf16> -> !torch.vtensor<[128,256],f16> loc(#loc56)
    %17 = torch.vtensor.literal(dense<1.000000e+00> : tensor<f32>) : !torch.vtensor<[],f32> loc(#loc57)
    %18 = torch.vtensor.literal(dense<1.000000e+00> : tensor<f32>) : !torch.vtensor<[],f32> loc(#loc58)
    %19 = torch.vtensor.literal(dense<0xFC00> : tensor<f16>) : !torch.vtensor<[],f16> loc(#loc59)
    %__auto.constant_256_256_torch.float16$4 = util.global.load @__auto.constant_256_256_torch.float16$4 : tensor<256x256xf16> loc(#loc60)
    %20 = torch_c.from_builtin_tensor %__auto.constant_256_256_torch.float16$4 : tensor<256x256xf16> -> !torch.vtensor<[256,256],f16> loc(#loc61)
    %21 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32_3> : tensor<256xf32>) : !torch.vtensor<[256],f32> loc(#loc62)
    %__auto.constant_23_256_torch.float16$2 = util.global.load @__auto.constant_23_256_torch.float16$2 : tensor<23x256xf16> loc(#loc63)
    %22 = torch_c.from_builtin_tensor %__auto.constant_23_256_torch.float16$2 : tensor<23x256xf16> -> !torch.vtensor<[23,256],f16> loc(#loc64)
    %__auto.constant_23_256_torch.float16$3 = util.global.load @__auto.constant_23_256_torch.float16$3 : tensor<23x256xf16> loc(#loc65)
    %23 = torch_c.from_builtin_tensor %__auto.constant_23_256_torch.float16$3 : tensor<23x256xf16> -> !torch.vtensor<[23,256],f16> loc(#loc66)
    %__auto.constant_256_23_torch.float16$1 = util.global.load @__auto.constant_256_23_torch.float16$1 : tensor<256x23xf16> loc(#loc67)
    %24 = torch_c.from_builtin_tensor %__auto.constant_256_23_torch.float16$1 : tensor<256x23xf16> -> !torch.vtensor<[256,23],f16> loc(#loc68)
    %25 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32_4> : tensor<256xf32>) : !torch.vtensor<[256],f32> loc(#loc69)
    %__auto.constant_256_256_torch.float16$5 = util.global.load @__auto.constant_256_256_torch.float16$5 : tensor<256x256xf16> loc(#loc70)
    %26 = torch_c.from_builtin_tensor %__auto.constant_256_256_torch.float16$5 : tensor<256x256xf16> -> !torch.vtensor<[256,256],f16> loc(#loc71)
    %__auto.constant_128_256_torch.float16$4 = util.global.load @__auto.constant_128_256_torch.float16$4 : tensor<128x256xf16> loc(#loc72)
    %27 = torch_c.from_builtin_tensor %__auto.constant_128_256_torch.float16$4 : tensor<128x256xf16> -> !torch.vtensor<[128,256],f16> loc(#loc73)
    %__auto.constant_128_256_torch.float16$5 = util.global.load @__auto.constant_128_256_torch.float16$5 : tensor<128x256xf16> loc(#loc74)
    %28 = torch_c.from_builtin_tensor %__auto.constant_128_256_torch.float16$5 : tensor<128x256xf16> -> !torch.vtensor<[128,256],f16> loc(#loc75)
    %29 = torch.vtensor.literal(dense<1.000000e+00> : tensor<f32>) : !torch.vtensor<[],f32> loc(#loc76)
    %30 = torch.vtensor.literal(dense<1.000000e+00> : tensor<f32>) : !torch.vtensor<[],f32> loc(#loc77)
    %31 = torch.vtensor.literal(dense<0xFC00> : tensor<f16>) : !torch.vtensor<[],f16> loc(#loc78)
    %__auto.constant_256_256_torch.float16$6 = util.global.load @__auto.constant_256_256_torch.float16$6 : tensor<256x256xf16> loc(#loc79)
    %32 = torch_c.from_builtin_tensor %__auto.constant_256_256_torch.float16$6 : tensor<256x256xf16> -> !torch.vtensor<[256,256],f16> loc(#loc80)
    %33 = torch.vtensor.literal(dense_resource<torch_tensor_256_torch.float32_5> : tensor<256xf32>) : !torch.vtensor<[256],f32> loc(#loc81)
    %__auto.constant_23_256_torch.float16$4 = util.global.load @__auto.constant_23_256_torch.float16$4 : tensor<23x256xf16> loc(#loc82)
    %34 = torch_c.from_builtin_tensor %__auto.constant_23_256_torch.float16$4 : tensor<23x256xf16> -> !torch.vtensor<[23,256],f16> loc(#loc83)
    %__auto.constant_23_256_torch.float16$5 = util.global.load @__auto.constant_23_256_torch.float16$5 : tensor<23x256xf16> loc(#loc84)
    %35 = torch_c.from_builtin_tensor %__auto.constant_23_256_torch.float16$5 : tensor<23x256xf16> -> !torch.vtensor<[23,256],f16> loc(#loc85)
    %__auto.constant_256_23_torch.float16$2 = util.global.load @__auto.constant_256_23_torch.float16$2 : tensor<256x23xf16> loc(#loc86)
    %36 = torch_c.from_builtin_tensor %__auto.constant_256_23_torch.float16$2 : tensor<256x23xf16> -> !torch.vtensor<[256,23],f16> loc(#loc87)
    %37 = torch.vtensor.literal(dense_resource<torch_tensor_1_256_torch.float32> : tensor<1x256xf32>) : !torch.vtensor<[1,256],f32> loc(#loc88)
    %__auto.constant_256_256_torch.float16$7 = util.global.load @__auto.constant_256_256_torch.float16$7 : tensor<256x256xf16> loc(#loc89)
    %38 = torch_c.from_builtin_tensor %__auto.constant_256_256_torch.float16$7 : tensor<256x256xf16> -> !torch.vtensor<[256,256],f16> loc(#loc90)
    %39 = torch.copy.to_vtensor %arg3 : !torch.vtensor<[?,12288],f16> loc(#loc91)
    %40 = torch.symbolic_int "16*s1" {min_val = 32, max_val = 112} : !torch.int loc(#loc92)
    %41 = torch.symbolic_int "s1" {min_val = 2, max_val = 7} : !torch.int loc(#loc93)
    %42 = torch.symbolic_int "s2" {min_val = 0, max_val = 9223372036854775807} : !torch.int loc(#loc94)
    torch.bind_symbolic_shape %arg0, [%41], affine_map<()[s0] -> (4, s0 * 16)> : !torch.vtensor<[4,?],si64> loc(#loc95)
    torch.bind_symbolic_shape %arg2, [%41], affine_map<()[s0] -> (4, s0)> : !torch.vtensor<[4,?],si64> loc(#loc96)
    torch.bind_symbolic_shape %39, [%42], affine_map<()[s0] -> (s0, 12288)> : !torch.vtensor<[?,12288],f16> loc(#loc97)
    %int1 = torch.constant.int 1 loc(#loc98)
    %43 = torch.aten.size.int %arg2, %int1 : !torch.vtensor<[4,?],si64>, !torch.int -> !torch.int loc(#loc99)
    %int0 = torch.constant.int 0 loc(#loc100)
    %44 = torch.aten.size.int %39, %int0 : !torch.vtensor<[?,12288],f16>, !torch.int -> !torch.int loc(#loc101)
    %int5 = torch.constant.int 5 loc(#loc102)
    %45 = torch.prims.convert_element_type %0, %int5 : !torch.vtensor<[256,256],f16>, !torch.int -> !torch.vtensor<[256,256],f16> loc(#loc103)
    %int-1 = torch.constant.int -1 loc(#loc104)
    %false = torch.constant.bool false loc(#loc105)
    %false_0 = torch.constant.bool false loc(#loc106)
    %46 = torch.aten.embedding %45, %arg0, %int-1, %false, %false_0 : !torch.vtensor<[256,256],f16>, !torch.vtensor<[4,?],si64>, !torch.int, !torch.bool, !torch.bool -> !torch.vtensor<[4,?,256],f16> loc(#loc107)
    torch.bind_symbolic_shape %46, [%41], affine_map<()[s0] -> (4, s0 * 16, 256)> : !torch.vtensor<[4,?,256],f16> loc(#loc108)
    %int1_1 = torch.constant.int 1 loc(#loc109)
    %47 = torch.aten.size.int %arg0, %int1_1 : !torch.vtensor<[4,?],si64>, !torch.int -> !torch.int loc(#loc110)
    %int6 = torch.constant.int 6 loc(#loc111)
    %48 = torch.prims.convert_element_type %46, %int6 : !torch.vtensor<[4,?,256],f16>, !torch.int -> !torch.vtensor<[4,?,256],f32> loc(#loc112)
    torch.bind_symbolic_shape %48, [%41], affine_map<()[s0] -> (4, s0 * 16, 256)> : !torch.vtensor<[4,?,256],f32> loc(#loc113)
    %int2 = torch.constant.int 2 loc(#loc114)
    %49 = torch.aten.pow.Tensor_Scalar %48, %int2 : !torch.vtensor<[4,?,256],f32>, !torch.int -> !torch.vtensor<[4,?,256],f32> loc(#loc115)
    torch.bind_symbolic_shape %49, [%41], affine_map<()[s0] -> (4, s0 * 16, 256)> : !torch.vtensor<[4,?,256],f32> loc(#loc116)
    %int-1_2 = torch.constant.int -1 loc(#loc117)
    %50 = torch.prim.ListConstruct %int-1_2 : (!torch.int) -> !torch.list<int> loc(#loc118)
    %true = torch.constant.bool true loc(#loc119)
    %none = torch.constant.none loc(#loc120)
    %51 = torch.aten.mean.dim %49, %50, %true, %none : !torch.vtensor<[4,?,256],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[4,?,1],f32> loc(#loc121)
    torch.bind_symbolic_shape %51, [%41], affine_map<()[s0] -> (4, s0 * 16, 1)> : !torch.vtensor<[4,?,1],f32> loc(#loc122)
    %float1.000000e-02 = torch.constant.float 1.000000e-02 loc(#loc123)
    %int1_3 = torch.constant.int 1 loc(#loc124)
    %52 = torch.aten.add.Scalar %51, %float1.000000e-02, %int1_3 : !torch.vtensor<[4,?,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[4,?,1],f32> loc(#loc125)
    torch.bind_symbolic_shape %52, [%41], affine_map<()[s0] -> (4, s0 * 16, 1)> : !torch.vtensor<[4,?,1],f32> loc(#loc126)
    %53 = torch.aten.rsqrt %52 : !torch.vtensor<[4,?,1],f32> -> !torch.vtensor<[4,?,1],f32> loc(#loc127)
    torch.bind_symbolic_shape %53, [%41], affine_map<()[s0] -> (4, s0 * 16, 1)> : !torch.vtensor<[4,?,1],f32> loc(#loc128)
    %54 = torch.aten.mul.Tensor %48, %53 : !torch.vtensor<[4,?,256],f32>, !torch.vtensor<[4,?,1],f32> -> !torch.vtensor<[4,?,256],f32> loc(#loc129)
    torch.bind_symbolic_shape %54, [%41], affine_map<()[s0] -> (4, s0 * 16, 256)> : !torch.vtensor<[4,?,256],f32> loc(#loc130)
    %int5_4 = torch.constant.int 5 loc(#loc131)
    %55 = torch.prims.convert_element_type %54, %int5_4 : !torch.vtensor<[4,?,256],f32>, !torch.int -> !torch.vtensor<[4,?,256],f16> loc(#loc132)
    torch.bind_symbolic_shape %55, [%41], affine_map<()[s0] -> (4, s0 * 16, 256)> : !torch.vtensor<[4,?,256],f16> loc(#loc133)
    %56 = torch.aten.mul.Tensor %1, %55 : !torch.vtensor<[256],f32>, !torch.vtensor<[4,?,256],f16> -> !torch.vtensor<[4,?,256],f32> loc(#loc134)
    torch.bind_symbolic_shape %56, [%41], affine_map<()[s0] -> (4, s0 * 16, 256)> : !torch.vtensor<[4,?,256],f32> loc(#loc135)
    %int5_5 = torch.constant.int 5 loc(#loc136)
    %57 = torch.prims.convert_element_type %56, %int5_5 : !torch.vtensor<[4,?,256],f32>, !torch.int -> !torch.vtensor<[4,?,256],f16> loc(#loc137)
    torch.bind_symbolic_shape %57, [%41], affine_map<()[s0] -> (4, s0 * 16, 256)> : !torch.vtensor<[4,?,256],f16> loc(#loc138)
    %int-2 = torch.constant.int -2 loc(#loc139)
    %int-1_6 = torch.constant.int -1 loc(#loc140)
    %58 = torch.aten.transpose.int %2, %int-2, %int-1_6 : !torch.vtensor<[256,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,256],f16> loc(#loc141)
    %int5_7 = torch.constant.int 5 loc(#loc142)
    %59 = torch.prims.convert_element_type %58, %int5_7 : !torch.vtensor<[256,256],f16>, !torch.int -> !torch.vtensor<[256,256],f16> loc(#loc143)
    %int4 = torch.constant.int 4 loc(#loc144)
    %60 = torch.aten.mul.int %int4, %47 : !torch.int, !torch.int -> !torch.int loc(#loc145)
    %int256 = torch.constant.int 256 loc(#loc146)
    %61 = torch.prim.ListConstruct %60, %int256 : (!torch.int, !torch.int) -> !torch.list<int> loc(#loc147)
    %62 = torch.aten.view %57, %61 : !torch.vtensor<[4,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16> loc(#loc148)
    torch.bind_symbolic_shape %62, [%41], affine_map<()[s0] -> (s0 * 64, 256)> : !torch.vtensor<[?,256],f16> loc(#loc149)
    %63 = torch.aten.matmul %62, %59 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,256],f16> -> !torch.vtensor<[?,256],f16> loc(#loc150)
    torch.bind_symbolic_shape %63, [%41], affine_map<()[s0] -> (s0 * 64, 256)> : !torch.vtensor<[?,256],f16> loc(#loc151)
    %int4_8 = torch.constant.int 4 loc(#loc152)
    %int256_9 = torch.constant.int 256 loc(#loc153)
    %64 = torch.prim.ListConstruct %int4_8, %47, %int256_9 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int> loc(#loc154)
    %65 = torch.aten.view %63, %64 : !torch.vtensor<[?,256],f16>, !torch.list<int> -> !torch.vtensor<[4,?,256],f16> loc(#loc155)
    torch.bind_symbolic_shape %65, [%41], affine_map<()[s0] -> (4, s0 * 16, 256)> : !torch.vtensor<[4,?,256],f16> loc(#loc156)
    %int-2_10 = torch.constant.int -2 loc(#loc157)
    %int-1_11 = torch.constant.int -1 loc(#loc158)
    %66 = torch.aten.transpose.int %3, %int-2_10, %int-1_11 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16> loc(#loc159)
    %int5_12 = torch.constant.int 5 loc(#loc160)
    %67 = torch.prims.convert_element_type %66, %int5_12 : !torch.vtensor<[256,128],f16>, !torch.int -> !torch.vtensor<[256,128],f16> loc(#loc161)
    %int256_13 = torch.constant.int 256 loc(#loc162)
    %68 = torch.prim.ListConstruct %60, %int256_13 : (!torch.int, !torch.int) -> !torch.list<int> loc(#loc163)
    %69 = torch.aten.view %57, %68 : !torch.vtensor<[4,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16> loc(#loc164)
    torch.bind_symbolic_shape %69, [%41], affine_map<()[s0] -> (s0 * 64, 256)> : !torch.vtensor<[?,256],f16> loc(#loc165)
    %70 = torch.aten.matmul %69, %67 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16> loc(#loc166)
    torch.bind_symbolic_shape %70, [%41], affine_map<()[s0] -> (s0 * 64, 128)> : !torch.vtensor<[?,128],f16> loc(#loc167)
    %int4_14 = torch.constant.int 4 loc(#loc168)
    %int128 = torch.constant.int 128 loc(#loc169)
    %71 = torch.prim.ListConstruct %int4_14, %47, %int128 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int> loc(#loc170)
    %72 = torch.aten.view %70, %71 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[4,?,128],f16> loc(#loc171)
    torch.bind_symbolic_shape %72, [%41], affine_map<()[s0] -> (4, s0 * 16, 128)> : !torch.vtensor<[4,?,128],f16> loc(#loc172)
    %int-2_15 = torch.constant.int -2 loc(#loc173)
    %int-1_16 = torch.constant.int -1 loc(#loc174)
    %73 = torch.aten.transpose.int %4, %int-2_15, %int-1_16 : !torch.vtensor<[128,256],f16>, !torch.int, !torch.int -> !torch.vtensor<[256,128],f16> loc(#loc175)
    %int5_17 = torch.constant.int 5 loc(#loc176)
    %74 = torch.prims.convert_element_type %73, %int5_17 : !torch.vtensor<[256,128],f16>, !torch.int -> !torch.vtensor<[256,128],f16> loc(#loc177)
    %int256_18 = torch.constant.int 256 loc(#loc178)
    %75 = torch.prim.ListConstruct %60, %int256_18 : (!torch.int, !torch.int) -> !torch.list<int> loc(#loc179)
    %76 = torch.aten.view %57, %75 : !torch.vtensor<[4,?,256],f16>, !torch.list<int> -> !torch.vtensor<[?,256],f16> loc(#loc180)
    torch.bind_symbolic_shape %76, [%41], affine_map<()[s0] -> (s0 * 64, 256)> : !torch.vtensor<[?,256],f16> loc(#loc181)
    %77 = torch.aten.matmul %76, %74 : !torch.vtensor<[?,256],f16>, !torch.vtensor<[256,128],f16> -> !torch.vtensor<[?,128],f16> loc(#loc182)
    torch.bind_symbolic_shape %77, [%41], affine_map<()[s0] -> (s0 * 64, 128)> : !torch.vtensor<[?,128],f16> loc(#loc183)
    %int4_19 = torch.constant.int 4 loc(#loc184)
    %int128_20 = torch.constant.int 128 loc(#loc185)
    %78 = torch.prim.ListConstruct %int4_19, %47, %int128_20 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int> loc(#loc186)
    %79 = torch.aten.view %77, %78 : !torch.vtensor<[?,128],f16>, !torch.list<int> -> !torch.vtensor<[4,?,128],f16> loc(#loc187)
    torch.bind_symbolic_shape %79, [%41], affine_map<()[s0] -> (4, s0 * 16, 128)> : !torch.vtensor<[4,?,128],f16> loc(#loc188)
    %int4_21 = torch.constant.int 4 loc(#loc189)
    %int8 = torch.constant.int 8 loc(#loc190)
    %int32 = torch.constant.int 32 loc(#loc191)
    %80 = torch.prim.ListConstruct %int4_21, %47, %int8, %int32 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int> loc(#loc192)
    %81 = torch.aten.view %65, %80 : !torch.vtensor<[4,?,256],f16>, !torch.list<int> -> !torch.vtensor<[4,?,8,32],f16> loc(#loc193)
    torch.bind_symbolic_shape %81, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 32)> : !torch.vtensor<[4,?,8,32],f16> loc(#loc194)
    %int4_22 = torch.constant.int 4 loc(#loc195)
    %int4_23 = torch.constant.int 4 loc(#loc196)
    %int32_24 = torch.constant.int 32 loc(#loc197)
    %82 = torch.prim.ListConstruct %int4_22, %47, %int4_23, %int32_24 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int> loc(#loc198)
    %83 = torch.aten.view %72, %82 : !torch.vtensor<[4,?,128],f16>, !torch.list<int> -> !torch.vtensor<[4,?,4,32],f16> loc(#loc199)
    torch.bind_symbolic_shape %83, [%41], affine_map<()[s0] -> (4, s0 * 16, 4, 32)> : !torch.vtensor<[4,?,4,32],f16> loc(#loc200)
    %int4_25 = torch.constant.int 4 loc(#loc201)
    %int4_26 = torch.constant.int 4 loc(#loc202)
    %int32_27 = torch.constant.int 32 loc(#loc203)
    %84 = torch.prim.ListConstruct %int4_25, %47, %int4_26, %int32_27 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int> loc(#loc204)
    %85 = torch.aten.view %79, %84 : !torch.vtensor<[4,?,128],f16>, !torch.list<int> -> !torch.vtensor<[4,?,4,32],f16> loc(#loc205)
    torch.bind_symbolic_shape %85, [%41], affine_map<()[s0] -> (4, s0 * 16, 4, 32)> : !torch.vtensor<[4,?,4,32],f16> loc(#loc206)
    %int0_28 = torch.constant.int 0 loc(#loc207)
    %none_29 = torch.constant.none loc(#loc208)
    %none_30 = torch.constant.none loc(#loc209)
    %cpu = torch.constant.device "cpu" loc(#loc210)
    %false_31 = torch.constant.bool false loc(#loc211)
    %86 = torch.aten.arange.start %int0_28, %47, %none_29, %none_30, %cpu, %false_31 : !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[?],si64> loc(#loc212)
    torch.bind_symbolic_shape %86, [%41], affine_map<()[s0] -> (s0 * 16)> : !torch.vtensor<[?],si64> loc(#loc213)
    %int0_32 = torch.constant.int 0 loc(#loc214)
    %87 = torch.aten.unsqueeze %86, %int0_32 : !torch.vtensor<[?],si64>, !torch.int -> !torch.vtensor<[1,?],si64> loc(#loc215)
    torch.bind_symbolic_shape %87, [%41], affine_map<()[s0] -> (1, s0 * 16)> : !torch.vtensor<[1,?],si64> loc(#loc216)
    %int0_33 = torch.constant.int 0 loc(#loc217)
    %int32_34 = torch.constant.int 32 loc(#loc218)
    %int2_35 = torch.constant.int 2 loc(#loc219)
    %none_36 = torch.constant.none loc(#loc220)
    %none_37 = torch.constant.none loc(#loc221)
    %cpu_38 = torch.constant.device "cpu" loc(#loc222)
    %false_39 = torch.constant.bool false loc(#loc223)
    %88 = torch.aten.arange.start_step %int0_33, %int32_34, %int2_35, %none_36, %none_37, %cpu_38, %false_39 : !torch.int, !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[16],si64> loc(#loc224)
    %int6_40 = torch.constant.int 6 loc(#loc225)
    %89 = torch.prims.convert_element_type %88, %int6_40 : !torch.vtensor<[16],si64>, !torch.int -> !torch.vtensor<[16],f32> loc(#loc226)
    %int32_41 = torch.constant.int 32 loc(#loc227)
    %90 = torch.aten.div.Scalar %89, %int32_41 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32> loc(#loc228)
    %float5.000000e05 = torch.constant.float 5.000000e+05 loc(#loc229)
    %91 = torch.aten.pow.Scalar %float5.000000e05, %90 : !torch.float, !torch.vtensor<[16],f32> -> !torch.vtensor<[16],f32> loc(#loc230)
    %92 = torch.aten.reciprocal %91 : !torch.vtensor<[16],f32> -> !torch.vtensor<[16],f32> loc(#loc231)
    %float1.000000e00 = torch.constant.float 1.000000e+00 loc(#loc232)
    %93 = torch.aten.mul.Scalar %92, %float1.000000e00 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32> loc(#loc233)
    %none_42 = torch.constant.none loc(#loc234)
    %94 = torch.aten.clone %5, %none_42 : !torch.vtensor<[],f32>, !torch.none -> !torch.vtensor<[],f32> loc(#loc235)
    %int0_43 = torch.constant.int 0 loc(#loc236)
    %95 = torch.aten.unsqueeze %93, %int0_43 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[1,16],f32> loc(#loc237)
    %int1_44 = torch.constant.int 1 loc(#loc238)
    %int0_45 = torch.constant.int 0 loc(#loc239)
    %int9223372036854775807 = torch.constant.int 9223372036854775807 loc(#loc240)
    %int1_46 = torch.constant.int 1 loc(#loc241)
    %96 = torch.aten.slice.Tensor %95, %int1_44, %int0_45, %int9223372036854775807, %int1_46 : !torch.vtensor<[1,16],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,16],f32> loc(#loc242)
    %int2_47 = torch.constant.int 2 loc(#loc243)
    %97 = torch.aten.unsqueeze %96, %int2_47 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32> loc(#loc244)
    %int6_48 = torch.constant.int 6 loc(#loc245)
    %98 = torch.prims.convert_element_type %97, %int6_48 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32> loc(#loc246)
    %int1_49 = torch.constant.int 1 loc(#loc247)
    %int-1_50 = torch.constant.int -1 loc(#loc248)
    %int1_51 = torch.constant.int 1 loc(#loc249)
    %99 = torch.prim.ListConstruct %int1_49, %int-1_50, %int1_51 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int> loc(#loc250)
    %false_52 = torch.constant.bool false loc(#loc251)
    %100 = torch.aten.expand %98, %99, %false_52 : !torch.vtensor<[1,16,1],f32>, !torch.list<int>, !torch.bool -> !torch.vtensor<[1,16,1],f32> loc(#loc252)
    %int0_53 = torch.constant.int 0 loc(#loc253)
    %int0_54 = torch.constant.int 0 loc(#loc254)
    %int9223372036854775807_55 = torch.constant.int 9223372036854775807 loc(#loc255)
    %int1_56 = torch.constant.int 1 loc(#loc256)
    %101 = torch.aten.slice.Tensor %87, %int0_53, %int0_54, %int9223372036854775807_55, %int1_56 : !torch.vtensor<[1,?],si64>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?],si64> loc(#loc257)
    torch.bind_symbolic_shape %101, [%41], affine_map<()[s0] -> (1, s0 * 16)> : !torch.vtensor<[1,?],si64> loc(#loc258)
    %int1_57 = torch.constant.int 1 loc(#loc259)
    %102 = torch.aten.unsqueeze %101, %int1_57 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.vtensor<[1,1,?],si64> loc(#loc260)
    torch.bind_symbolic_shape %102, [%41], affine_map<()[s0] -> (1, 1, s0 * 16)> : !torch.vtensor<[1,1,?],si64> loc(#loc261)
    %int2_58 = torch.constant.int 2 loc(#loc262)
    %int0_59 = torch.constant.int 0 loc(#loc263)
    %int9223372036854775807_60 = torch.constant.int 9223372036854775807 loc(#loc264)
    %int1_61 = torch.constant.int 1 loc(#loc265)
    %103 = torch.aten.slice.Tensor %102, %int2_58, %int0_59, %int9223372036854775807_60, %int1_61 : !torch.vtensor<[1,1,?],si64>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,1,?],si64> loc(#loc266)
    torch.bind_symbolic_shape %103, [%41], affine_map<()[s0] -> (1, 1, s0 * 16)> : !torch.vtensor<[1,1,?],si64> loc(#loc267)
    %int6_62 = torch.constant.int 6 loc(#loc268)
    %104 = torch.prims.convert_element_type %103, %int6_62 : !torch.vtensor<[1,1,?],si64>, !torch.int -> !torch.vtensor<[1,1,?],f32> loc(#loc269)
    torch.bind_symbolic_shape %104, [%41], affine_map<()[s0] -> (1, 1, s0 * 16)> : !torch.vtensor<[1,1,?],f32> loc(#loc270)
    %105 = torch.aten.matmul %100, %104 : !torch.vtensor<[1,16,1],f32>, !torch.vtensor<[1,1,?],f32> -> !torch.vtensor<[1,16,?],f32> loc(#loc271)
    torch.bind_symbolic_shape %105, [%41], affine_map<()[s0] -> (1, 16, s0 * 16)> : !torch.vtensor<[1,16,?],f32> loc(#loc272)
    %int1_63 = torch.constant.int 1 loc(#loc273)
    %int2_64 = torch.constant.int 2 loc(#loc274)
    %106 = torch.aten.transpose.int %105, %int1_63, %int2_64 : !torch.vtensor<[1,16,?],f32>, !torch.int, !torch.int -> !torch.vtensor<[1,?,16],f32> loc(#loc275)
    torch.bind_symbolic_shape %106, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc276)
    %107 = torch.aten.cos %106 : !torch.vtensor<[1,?,16],f32> -> !torch.vtensor<[1,?,16],f32> loc(#loc277)
    torch.bind_symbolic_shape %107, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc278)
    %108 = torch.aten.mul.Tensor %107, %94 : !torch.vtensor<[1,?,16],f32>, !torch.vtensor<[],f32> -> !torch.vtensor<[1,?,16],f32> loc(#loc279)
    torch.bind_symbolic_shape %108, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc280)
    %int5_65 = torch.constant.int 5 loc(#loc281)
    %109 = torch.prims.convert_element_type %108, %int5_65 : !torch.vtensor<[1,?,16],f32>, !torch.int -> !torch.vtensor<[1,?,16],f16> loc(#loc282)
    torch.bind_symbolic_shape %109, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f16> loc(#loc283)
    %110 = torch.aten.sin %106 : !torch.vtensor<[1,?,16],f32> -> !torch.vtensor<[1,?,16],f32> loc(#loc284)
    torch.bind_symbolic_shape %110, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc285)
    %111 = torch.aten.mul.Tensor %110, %94 : !torch.vtensor<[1,?,16],f32>, !torch.vtensor<[],f32> -> !torch.vtensor<[1,?,16],f32> loc(#loc286)
    torch.bind_symbolic_shape %111, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc287)
    %int5_66 = torch.constant.int 5 loc(#loc288)
    %112 = torch.prims.convert_element_type %111, %int5_66 : !torch.vtensor<[1,?,16],f32>, !torch.int -> !torch.vtensor<[1,?,16],f16> loc(#loc289)
    torch.bind_symbolic_shape %112, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f16> loc(#loc290)
    %int2_67 = torch.constant.int 2 loc(#loc291)
    %113 = torch.aten.unsqueeze %109, %int2_67 : !torch.vtensor<[1,?,16],f16>, !torch.int -> !torch.vtensor<[1,?,1,16],f16> loc(#loc292)
    torch.bind_symbolic_shape %113, [%41], affine_map<()[s0] -> (1, s0 * 16, 1, 16)> : !torch.vtensor<[1,?,1,16],f16> loc(#loc293)
    %int2_68 = torch.constant.int 2 loc(#loc294)
    %114 = torch.aten.unsqueeze %112, %int2_68 : !torch.vtensor<[1,?,16],f16>, !torch.int -> !torch.vtensor<[1,?,1,16],f16> loc(#loc295)
    torch.bind_symbolic_shape %114, [%41], affine_map<()[s0] -> (1, s0 * 16, 1, 16)> : !torch.vtensor<[1,?,1,16],f16> loc(#loc296)
    %int5_69 = torch.constant.int 5 loc(#loc297)
    %115 = torch.prims.convert_element_type %81, %int5_69 : !torch.vtensor<[4,?,8,32],f16>, !torch.int -> !torch.vtensor<[4,?,8,32],f16> loc(#loc298)
    torch.bind_symbolic_shape %115, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 32)> : !torch.vtensor<[4,?,8,32],f16> loc(#loc299)
    %int3 = torch.constant.int 3 loc(#loc300)
    %int0_70 = torch.constant.int 0 loc(#loc301)
    %int32_71 = torch.constant.int 32 loc(#loc302)
    %int2_72 = torch.constant.int 2 loc(#loc303)
    %116 = torch.aten.slice.Tensor %115, %int3, %int0_70, %int32_71, %int2_72 : !torch.vtensor<[4,?,8,32],f16>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[4,?,8,16],f16> loc(#loc304)
    torch.bind_symbolic_shape %116, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 16)> : !torch.vtensor<[4,?,8,16],f16> loc(#loc305)
    %int3_73 = torch.constant.int 3 loc(#loc306)
    %int1_74 = torch.constant.int 1 loc(#loc307)
    %int32_75 = torch.constant.int 32 loc(#loc308)
    %int2_76 = torch.constant.int 2 loc(#loc309)
    %117 = torch.aten.slice.Tensor %115, %int3_73, %int1_74, %int32_75, %int2_76 : !torch.vtensor<[4,?,8,32],f16>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[4,?,8,16],f16> loc(#loc310)
    torch.bind_symbolic_shape %117, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 16)> : !torch.vtensor<[4,?,8,16],f16> loc(#loc311)
    %118 = torch.aten.mul.Tensor %116, %113 : !torch.vtensor<[4,?,8,16],f16>, !torch.vtensor<[1,?,1,16],f16> -> !torch.vtensor<[4,?,8,16],f16> loc(#loc312)
    torch.bind_symbolic_shape %118, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 16)> : !torch.vtensor<[4,?,8,16],f16> loc(#loc313)
    %119 = torch.aten.mul.Tensor %117, %114 : !torch.vtensor<[4,?,8,16],f16>, !torch.vtensor<[1,?,1,16],f16> -> !torch.vtensor<[4,?,8,16],f16> loc(#loc314)
    torch.bind_symbolic_shape %119, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 16)> : !torch.vtensor<[4,?,8,16],f16> loc(#loc315)
    %int1_77 = torch.constant.int 1 loc(#loc316)
    %120 = torch.aten.sub.Tensor %118, %119, %int1_77 : !torch.vtensor<[4,?,8,16],f16>, !torch.vtensor<[4,?,8,16],f16>, !torch.int -> !torch.vtensor<[4,?,8,16],f16> loc(#loc317)
    torch.bind_symbolic_shape %120, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 16)> : !torch.vtensor<[4,?,8,16],f16> loc(#loc318)
    %121 = torch.aten.mul.Tensor %117, %113 : !torch.vtensor<[4,?,8,16],f16>, !torch.vtensor<[1,?,1,16],f16> -> !torch.vtensor<[4,?,8,16],f16> loc(#loc319)
    torch.bind_symbolic_shape %121, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 16)> : !torch.vtensor<[4,?,8,16],f16> loc(#loc320)
    %122 = torch.aten.mul.Tensor %116, %114 : !torch.vtensor<[4,?,8,16],f16>, !torch.vtensor<[1,?,1,16],f16> -> !torch.vtensor<[4,?,8,16],f16> loc(#loc321)
    torch.bind_symbolic_shape %122, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 16)> : !torch.vtensor<[4,?,8,16],f16> loc(#loc322)
    %int1_78 = torch.constant.int 1 loc(#loc323)
    %123 = torch.aten.add.Tensor %121, %122, %int1_78 : !torch.vtensor<[4,?,8,16],f16>, !torch.vtensor<[4,?,8,16],f16>, !torch.int -> !torch.vtensor<[4,?,8,16],f16> loc(#loc324)
    torch.bind_symbolic_shape %123, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 16)> : !torch.vtensor<[4,?,8,16],f16> loc(#loc325)
    %124 = torch_c.to_builtin_tensor %120 : !torch.vtensor<[4,?,8,16],f16> -> tensor<4x?x8x16xf16> loc(#loc326)
    %cast = tensor.cast %124 : tensor<4x?x8x16xf16> to tensor<?x?x?x?xf16> loc(#loc327)
    %125 = torch_c.to_builtin_tensor %123 : !torch.vtensor<[4,?,8,16],f16> -> tensor<4x?x8x16xf16> loc(#loc328)
    %cast_79 = tensor.cast %125 : tensor<4x?x8x16xf16> to tensor<?x?x?x?xf16> loc(#loc329)
    %126 = util.call @rope_select_concat_BS_SL_HEADS_HALFDIM_f16_BS_SL_HEADS_HALFDIM_f16_BS_SL_HEADS_TWO_2_HALFDIM_f16(%cast, %cast_79) : (tensor<?x?x?x?xf16>, tensor<?x?x?x?xf16>) -> tensor<?x?x?x2x?xf16> loc(#loc330)
    %cast_80 = tensor.cast %126 : tensor<?x?x?x2x?xf16> to tensor<4x?x8x2x16xf16> loc(#loc331)
    %127 = torch_c.from_builtin_tensor %cast_80 : tensor<4x?x8x2x16xf16> -> !torch.vtensor<[4,?,8,2,16],f16> loc(#loc332)
    torch.bind_symbolic_shape %127, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 2, 16)> : !torch.vtensor<[4,?,8,2,16],f16> loc(#loc333)
    %int4_81 = torch.constant.int 4 loc(#loc334)
    %int8_82 = torch.constant.int 8 loc(#loc335)
    %int32_83 = torch.constant.int 32 loc(#loc336)
    %128 = torch.prim.ListConstruct %int4_81, %47, %int8_82, %int32_83 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int> loc(#loc337)
    %129 = torch.aten.view %127, %128 : !torch.vtensor<[4,?,8,2,16],f16>, !torch.list<int> -> !torch.vtensor<[4,?,8,32],f16> loc(#loc338)
    torch.bind_symbolic_shape %129, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 32)> : !torch.vtensor<[4,?,8,32],f16> loc(#loc339)
    %int5_84 = torch.constant.int 5 loc(#loc340)
    %130 = torch.prims.convert_element_type %129, %int5_84 : !torch.vtensor<[4,?,8,32],f16>, !torch.int -> !torch.vtensor<[4,?,8,32],f16> loc(#loc341)
    torch.bind_symbolic_shape %130, [%41], affine_map<()[s0] -> (4, s0 * 16, 8, 32)> : !torch.vtensor<[4,?,8,32],f16> loc(#loc342)
    %int0_85 = torch.constant.int 0 loc(#loc343)
    %none_86 = torch.constant.none loc(#loc344)
    %none_87 = torch.constant.none loc(#loc345)
    %cpu_88 = torch.constant.device "cpu" loc(#loc346)
    %false_89 = torch.constant.bool false loc(#loc347)
    %131 = torch.aten.arange.start %int0_85, %47, %none_86, %none_87, %cpu_88, %false_89 : !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[?],si64> loc(#loc348)
    torch.bind_symbolic_shape %131, [%41], affine_map<()[s0] -> (s0 * 16)> : !torch.vtensor<[?],si64> loc(#loc349)
    %int0_90 = torch.constant.int 0 loc(#loc350)
    %132 = torch.aten.unsqueeze %131, %int0_90 : !torch.vtensor<[?],si64>, !torch.int -> !torch.vtensor<[1,?],si64> loc(#loc351)
    torch.bind_symbolic_shape %132, [%41], affine_map<()[s0] -> (1, s0 * 16)> : !torch.vtensor<[1,?],si64> loc(#loc352)
    %int0_91 = torch.constant.int 0 loc(#loc353)
    %int32_92 = torch.constant.int 32 loc(#loc354)
    %int2_93 = torch.constant.int 2 loc(#loc355)
    %none_94 = torch.constant.none loc(#loc356)
    %none_95 = torch.constant.none loc(#loc357)
    %cpu_96 = torch.constant.device "cpu" loc(#loc358)
    %false_97 = torch.constant.bool false loc(#loc359)
    %133 = torch.aten.arange.start_step %int0_91, %int32_92, %int2_93, %none_94, %none_95, %cpu_96, %false_97 : !torch.int, !torch.int, !torch.int, !torch.none, !torch.none, !torch.Device, !torch.bool -> !torch.vtensor<[16],si64> loc(#loc360)
    %int6_98 = torch.constant.int 6 loc(#loc361)
    %134 = torch.prims.convert_element_type %133, %int6_98 : !torch.vtensor<[16],si64>, !torch.int -> !torch.vtensor<[16],f32> loc(#loc362)
    %int32_99 = torch.constant.int 32 loc(#loc363)
    %135 = torch.aten.div.Scalar %134, %int32_99 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32> loc(#loc364)
    %float5.000000e05_100 = torch.constant.float 5.000000e+05 loc(#loc365)
    %136 = torch.aten.pow.Scalar %float5.000000e05_100, %135 : !torch.float, !torch.vtensor<[16],f32> -> !torch.vtensor<[16],f32> loc(#loc366)
    %137 = torch.aten.reciprocal %136 : !torch.vtensor<[16],f32> -> !torch.vtensor<[16],f32> loc(#loc367)
    %float1.000000e00_101 = torch.constant.float 1.000000e+00 loc(#loc368)
    %138 = torch.aten.mul.Scalar %137, %float1.000000e00_101 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32> loc(#loc369)
    %none_102 = torch.constant.none loc(#loc370)
    %139 = torch.aten.clone %6, %none_102 : !torch.vtensor<[],f32>, !torch.none -> !torch.vtensor<[],f32> loc(#loc371)
    %int0_103 = torch.constant.int 0 loc(#loc372)
    %140 = torch.aten.unsqueeze %138, %int0_103 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[1,16],f32> loc(#loc373)
    %int1_104 = torch.constant.int 1 loc(#loc374)
    %int0_105 = torch.constant.int 0 loc(#loc375)
    %int9223372036854775807_106 = torch.constant.int 9223372036854775807 loc(#loc376)
    %int1_107 = torch.constant.int 1 loc(#loc377)
    %141 = torch.aten.slice.Tensor %140, %int1_104, %int0_105, %int9223372036854775807_106, %int1_107 : !torch.vtensor<[1,16],f32>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,16],f32> loc(#loc378)
    %int2_108 = torch.constant.int 2 loc(#loc379)
    %142 = torch.aten.unsqueeze %141, %int2_108 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32> loc(#loc380)
    %int6_109 = torch.constant.int 6 loc(#loc381)
    %143 = torch.prims.convert_element_type %142, %int6_109 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32> loc(#loc382)
    %int1_110 = torch.constant.int 1 loc(#loc383)
    %int-1_111 = torch.constant.int -1 loc(#loc384)
    %int1_112 = torch.constant.int 1 loc(#loc385)
    %144 = torch.prim.ListConstruct %int1_110, %int-1_111, %int1_112 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int> loc(#loc386)
    %false_113 = torch.constant.bool false loc(#loc387)
    %145 = torch.aten.expand %143, %144, %false_113 : !torch.vtensor<[1,16,1],f32>, !torch.list<int>, !torch.bool -> !torch.vtensor<[1,16,1],f32> loc(#loc388)
    %int0_114 = torch.constant.int 0 loc(#loc389)
    %int0_115 = torch.constant.int 0 loc(#loc390)
    %int9223372036854775807_116 = torch.constant.int 9223372036854775807 loc(#loc391)
    %int1_117 = torch.constant.int 1 loc(#loc392)
    %146 = torch.aten.slice.Tensor %132, %int0_114, %int0_115, %int9223372036854775807_116, %int1_117 : !torch.vtensor<[1,?],si64>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,?],si64> loc(#loc393)
    torch.bind_symbolic_shape %146, [%41], affine_map<()[s0] -> (1, s0 * 16)> : !torch.vtensor<[1,?],si64> loc(#loc394)
    %int1_118 = torch.constant.int 1 loc(#loc395)
    %147 = torch.aten.unsqueeze %146, %int1_118 : !torch.vtensor<[1,?],si64>, !torch.int -> !torch.vtensor<[1,1,?],si64> loc(#loc396)
    torch.bind_symbolic_shape %147, [%41], affine_map<()[s0] -> (1, 1, s0 * 16)> : !torch.vtensor<[1,1,?],si64> loc(#loc397)
    %int2_119 = torch.constant.int 2 loc(#loc398)
    %int0_120 = torch.constant.int 0 loc(#loc399)
    %int9223372036854775807_121 = torch.constant.int 9223372036854775807 loc(#loc400)
    %int1_122 = torch.constant.int 1 loc(#loc401)
    %148 = torch.aten.slice.Tensor %147, %int2_119, %int0_120, %int9223372036854775807_121, %int1_122 : !torch.vtensor<[1,1,?],si64>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[1,1,?],si64> loc(#loc402)
    torch.bind_symbolic_shape %148, [%41], affine_map<()[s0] -> (1, 1, s0 * 16)> : !torch.vtensor<[1,1,?],si64> loc(#loc403)
    %int6_123 = torch.constant.int 6 loc(#loc404)
    %149 = torch.prims.convert_element_type %148, %int6_123 : !torch.vtensor<[1,1,?],si64>, !torch.int -> !torch.vtensor<[1,1,?],f32> loc(#loc405)
    torch.bind_symbolic_shape %149, [%41], affine_map<()[s0] -> (1, 1, s0 * 16)> : !torch.vtensor<[1,1,?],f32> loc(#loc406)
    %150 = torch.aten.matmul %145, %149 : !torch.vtensor<[1,16,1],f32>, !torch.vtensor<[1,1,?],f32> -> !torch.vtensor<[1,16,?],f32> loc(#loc407)
    torch.bind_symbolic_shape %150, [%41], affine_map<()[s0] -> (1, 16, s0 * 16)> : !torch.vtensor<[1,16,?],f32> loc(#loc408)
    %int1_124 = torch.constant.int 1 loc(#loc409)
    %int2_125 = torch.constant.int 2 loc(#loc410)
    %151 = torch.aten.transpose.int %150, %int1_124, %int2_125 : !torch.vtensor<[1,16,?],f32>, !torch.int, !torch.int -> !torch.vtensor<[1,?,16],f32> loc(#loc411)
    torch.bind_symbolic_shape %151, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc412)
    %152 = torch.aten.cos %151 : !torch.vtensor<[1,?,16],f32> -> !torch.vtensor<[1,?,16],f32> loc(#loc413)
    torch.bind_symbolic_shape %152, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc414)
    %153 = torch.aten.mul.Tensor %152, %139 : !torch.vtensor<[1,?,16],f32>, !torch.vtensor<[],f32> -> !torch.vtensor<[1,?,16],f32> loc(#loc415)
    torch.bind_symbolic_shape %153, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc416)
    %int5_126 = torch.constant.int 5 loc(#loc417)
    %154 = torch.prims.convert_element_type %153, %int5_126 : !torch.vtensor<[1,?,16],f32>, !torch.int -> !torch.vtensor<[1,?,16],f16> loc(#loc418)
    torch.bind_symbolic_shape %154, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f16> loc(#loc419)
    %155 = torch.aten.sin %151 : !torch.vtensor<[1,?,16],f32> -> !torch.vtensor<[1,?,16],f32> loc(#loc420)
    torch.bind_symbolic_shape %155, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc421)
    %156 = torch.aten.mul.Tensor %155, %139 : !torch.vtensor<[1,?,16],f32>, !torch.vtensor<[],f32> -> !torch.vtensor<[1,?,16],f32> loc(#loc422)
    torch.bind_symbolic_shape %156, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f32> loc(#loc423)
    %int5_127 = torch.constant.int 5 loc(#loc424)
    %157 = torch.prims.convert_element_type %156, %int5_127 : !torch.vtensor<[1,?,16],f32>, !torch.int -> !torch.vtensor<[1,?,16],f16> loc(#loc425)
    torch.bind_symbolic_shape %157, [%41], affine_map<()[s0] -> (1, s0 * 16, 16)> : !torch.vtensor<[1,?,16],f16> loc(#loc426)
    %int2_128 = torch.constant.int 2 loc(#loc427)
    %158 = torch.aten.unsqueeze %154, %int2_128 : !torch.vtensor<[1,?,16],f16>, !torch.int -> !torch.vtensor<[1,?,1,16],f16> loc(#loc428)
    torch.bind_symbolic_shape %158, [%41], affine_map<()[s0] -> (1, s0 * 16, 1, 16)> : !torch.vtensor<[1,?,1,16],f16> loc(#loc429)
    %int2_129 = torch.constant.int 2 loc(#loc430)
    %159 = torch.aten.unsqueeze %157, %int2_129 : !torch.vtensor<[1,?,16],f16>, !torch.int -> !torch.vtensor<[1,?,1,16],f16> loc(#loc431)
    torch.bind_symbolic_shape %159, [%41], affine_map<()[s0] -> (1, s0 * 16, 1, 16)> : !torch.vtensor<[1,?,1,16],f16> loc(#loc432)
    %int5_130 = torch.constant.int 5 loc(#loc433)
    %160 = torch.prims.convert_element_type %83, %int5_130 : !torch.vtensor<[4,?,4,32],f16>, !torch.int -> !torch.vtensor<[4,?,4,32],f16> loc(#loc434)
    torch.bind_symbolic_shape %160, [%41], affine_map<()[s0] -> (4, s0 * 16, 4, 32)> : !torch.vtensor<[4,?,4,32],f16> loc(#loc435)
    %int3_131 = torch.constant.int 3 loc(#loc436)
    %int0_132 = torch.constant.int 0 loc(#loc437)
    %int32_133 = torch.constant.int 32 loc(#loc438)
    %int2_134 = torch.constant.int 2 loc(#loc439)
    %161 = torch.aten.slice.Tensor %160, %int3_131, %int0_132, %int32_133, %int2_134 : !torch.vtensor<[4,?,4,32],f16>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[4,?,4,16],f16> loc(#loc440)
    torch.bind_symbolic_shape %161, [%41], affine_map<()[s0] -> (4, s0 * 16, 4, 16)> : !torch.vtensor<[4,?,4,16],f16> loc(#loc441)
    %int3_135 = torch.constant.int 3 loc(#loc442)
    %int1_136 = torch.constant.int 1 loc(#loc443)
    %int32_137 = torch.constant.int 32 loc(#loc444)
    %int2_138 = torch.constant.int 2 loc(#loc445)
    %162 = torch.aten.slice.Tensor %160, %int3_135, %int1_136, %int32_137, %int2_138 : !torch.vtensor<[4,?,4,32],f16>, !torch.int, !torch.int, !torch.int, !torch.int -> !torch.vtensor<[4,?,4,16],f16> loc(#loc446)
    torch.bind_symbolic_shape %162, [%41], affine_map<()[s0] -> (4, s0 * 16, 4, 16)> : !torch.vtensor<[4,?,4,16],f16> loc(#loc447)
    %163 = torch.aten.mul.Tensor %161, %158 : !torch.vtensor<[4,?,4,16],f16>, !torch.vtensor<[1,?,1,16],f16> -> !torch.vtensor<[4,?,4,16],f16> loc(#loc448)
    torch.bind_symbolic_shape %163, [%41], affine_map<()[s0] -> (4, s0 * 16, 4, 16)> : !torch.vtensor<[4,?,4,16],f16> loc(#loc449)
    %164 = torch.aten.mul.Tensor %162, %159 : !torch.vtensor<[4,?,4,16],f16>, !torch.vtensor<[1,?,1,16],f16> -> !torch.vtensor<[4,?,4,16],f16> loc(#loc450)
    torch.bind_symbolic_shape %164, [%41], affine_map<()[s0] -> (4, s0 * 16, 4, 16)> : !torch.vtensor<[4,?,4,16],f16> loc(#loc451)
    %int1_139 = torch.constant.int 1 loc(#loc452)
    %165 = torch.aten.sub.Tensor %163, %164, %int1_139 : !torch.vtensor<[4,?,4,16],f16>, !torch.vtensor<[4,?,4,16],f16>, !torch.int -> !torch.vtensor<[4,?,4,16],f16> loc(#loc453)
    torch.bind_symbolic_shape %165, [%41], affine_map<()[s0] -> (4, s0 * 16, 4, 16)> : !torch.vtensor<[4,?,4,16],f16> loc(#loc454)
    %166 = torch.aten.mul.Tensor %162, %158 : !torch.vtensor<[4,?,4,16],f16>, !torch.vtensor<[1,?,1,16],f16> -> !torch.vtensor<[4,?,4,16],f16> loc(#loc455)
    torch.bind_symbolic_shape %166, [%41], affine_map<()[s0] -> (4, s0 * 16, 4, 16)> : !torch.vtensor<[4,?,4,16],f16> loc(#loc456)
